Diplom2/src/Documents/НачислениеОклада/НачислениеОклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеОклада</name>
  <registerRecords>CalculationRegister.ЗаработнаяПлата</registerRecords>
  <registerRecords>AccumulationRegister.ДолгиПоЗаработнойПлате</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Diplom2/src/CalculationRegisters/ЗаработнаяПлата/ЗаработнаяПлата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ЗаработнаяПлата</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикРаботы.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РасчетныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Diplom2/src/AccumulationRegisters/ДолгиПоЗаработнойПлате/ДолгиПоЗаработнойПлате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДолгиПоЗаработнойПлате</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom2/src/Documents/НачислениеОклада/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // Записываем движение в регистр расчёта
    Движения.ЗаработнаяПлата.Записывать = Истина;
    Движение = Движения.ЗаработнаяПлата.Добавить();
    Движение.Сторно             = Ложь;
    Движение.ВидРасчета         = ПланыВидовРасчета.Начисления.Оклад;
    Движение.ПериодДействияНачало = НачалоМесяца(Дата);
    Движение.ПериодДействияКонец = КонецМесяца(Дата);
    Движение.ПериодРегистрации  = Дата;
    Движение.Сотрудник          = Сотрудник;
    Движение.РасчетныеДанные    = Сумма;
    Движения.Записать();
    
    // Получаем данные графика
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    ЕСТЬNULL(ЗаработнаяПлатаДанныеГрафика.РабочийДеньПериодДействия, 0) КАК Норма,
    |    ЕСТЬNULL(ЗаработнаяПлатаДанныеГрафика.РабочийДеньФактическийПериодДействия, 0) КАК Факт,
    |    ЕСТЬNULL(ЗаработнаяПлатаДанныеГрафика.РасчетныеДанные, 0) КАК РасчетныеДанные
    |ИЗ
    |    РегистрРасчета.ЗаработнаяПлата.ДанныеГрафика(
    |        Регистратор = &Регистратор) КАК ЗаработнаяПлатаДанныеГрафика";
    
    Запрос.УстановитьПараметр("Регистратор", Ссылка);
    РезультатЗапроса = Запрос.Выполнить();
    
    Если НЕ РезультатЗапроса.Пустой() Тогда
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        ВыборкаДетальныеЗаписи.Следующий();
        
        Норма = ?(ТипЗнч(ВыборкаДетальныеЗаписи.Норма) = Тип("Число"),
                  ВыборкаДетальныеЗаписи.Норма, 0);
        Факт  = ?(ТипЗнч(ВыборкаДетальныеЗаписи.Факт) = Тип("Число"),
                  ВыборкаДетальныеЗаписи.Факт, 0);
        РасчДанные = ?(ТипЗнч(ВыборкаДетальныеЗаписи.РасчетныеДанные) = Тип("Число"),
                       ВыборкаДетальныеЗаписи.РасчетныеДанные, Сумма);
        
        Если Норма <> 0 Тогда
            Оклад = РасчДанные * Факт / Норма;
        Иначе
            // Если норма не заполнена — берём сумму напрямую
            Оклад = Сумма;
            Сообщить("График не заполнен, оклад начислен полностью: " + Оклад);
        КонецЕсли;
        
    Иначе
        // Данных графика нет — начисляем полный оклад
        Оклад = Сумма;
        Сообщить("Данные графика отсутствуют, оклад начислен полностью: " + Оклад);
    КонецЕсли;
    
    // Записываем итоговую сумму
    Движение.Сумма = Оклад;
    Движения.ЗаработнаяПлата.Записать();
    
    // Движение в регистр долгов
    Движения.ДолгиПоЗаработнойПлате.Записывать = Истина;
    ДвижДолг             = Движения.ДолгиПоЗаработнойПлате.Добавить();
    ДвижДолг.ВидДвижения = ВидДвиженияНакопления.Приход;
    ДвижДолг.Период      = Дата;
    ДвижДолг.Сотрудник   = Сотрудник;
    ДвижДолг.Сумма       = Оклад;
    
КонецПроцедуры
